backend/controllers/DocumentTemplateController.php

SELECT * FROM `document_template` WHERE `id`='1'
---
    protected function findModel($id)

    {


        if (($model = DocumentTemplate::findOne($id)) !== null) {