backend/controllers/StaffController.php

SELECT * FROM `staff` WHERE `id`='1'
---
    public function actionUpdate($id)
    {

        $model = new UpdateStaffForm();
        $userm = Staff::findOne($id);

SELECT * FROM `staff` WHERE `id`='1'
---
    protected function findModel($id)

    {


        if (($model = Staff::findOne($id)) !== null) {