backend/models/UpdateStaffForm.php

SELECT * FROM `staff` WHERE `id`='1'
---
    public function update($id,$password)
    {
        if (!$this->validate()) {
            return null;
        }

        $user = Staff::findOne($id);